<template>
    <hot-table
      :settings="settings"
      licenseKey="non-commercial-and-evaluation"
      :data="data"
      :rowHeaders="true"
      :colHeaders="true"></hot-table>
  </template>
  
  <script>
  import { defineComponent } from "vue";
  import { HotTable } from "@handsontable/vue3";
  import { registerAllModules } from "handsontable/registry";
  import "handsontable/dist/handsontable.full.css";
  
  // register Handsontable's modules
  registerAllModules();
  
  export default defineComponent({
    data() {
      return {
        data: [
          ["Дансны дугаар", "Дансны нэр", "СТ-ын мөр", "D/C"],
          [1001, "Касс", "Мөнгө, түүнтэй адилтгах хөрөнгө", "1.1.1", "D"],
          [1103, "Банкны данс", "Мөнгө, түүнтэй адилтгах хөрөнгө", "1.1.1", "D"],
          [1201, "авлага", "Дансны авлага", "1.1.2", "D"],
          [1501, "Бараа мат", "Бараа материал", "1.1.6", "D"],
          [1502, "Түүхий эд материал", "Бараа материал", "", "D"],
          [1503, "Дуусаагүй үйлдвэрлэл", "Бараа материал", "", "D"],
          [1504, "Бэлэн бүтээгдэхүүн", "Бараа материал", "", "D"],
          [1599, "ҮНЗ", "", "", ""],
          [2001, "Үндсэн хөр.", "Үндсэн хөрөнгө", "", "D"],
          [2010, "Үх-н хур.эл.", "Үндсэн хөрөнгө", "", "C"],
          [2002, "Биет бус хөрөнгө", "Биет бус хөрөнгө", "", "D"],
          [2020, "ББХ-н хур.эл.", "Биет бус хөрөнгө", "", "C"],
          [3101, "Өглөг", "Дансны өглөг", "", "C"],
          [3103, "хаоат өглөг", "Татварын өглөг", "", "C"],
          [3104, "Түрээсийн өглөг", "Дансны өглөг", "", "C"],
          [3105, "НӨАТ-ын өглөг", "Татварын өглөг", "", "C"],
          [3106, "ндш өглөг", "Татварын өглөг", "", "C"],
          [3109, "ааноат", "Татварын өглөг", "", "C"],
          [3110, "Банкны зээл", "Урт хугацаат зээл", "", "C"],
          [3107, "Урьдчилж орсон орлого", "Урьдчилж орсон орлого", "", "C"],
          [3111, "Бусад өглөг", "Бусад богино хугацаат өр төлбөр", "", "C"],
          [4101, "эз. Өмч", "б) хувийн", "", "C"],
          [4201, "хур. ашиг", "Хуримтлагдсан ашиг", "", "C"],
          [5101, "Брлт орлого", "Борлуулалтын орлого (цэвэр)", "", "C"],
          [5102, "хүүгийн орлого", "Хүүний орлого", "", "C"],
          [8101, "ханшны зөрүү", "Гадаад валютын ханшийн зөрүүний олз (гарз)", "", "C"],
          [6101, "ББӨ", "Борлуулалтын өртөг", "", "D"],
          [7001, "Цалин зардал (Уд)", "Ерөнхий ба удирдлагын зардал", "", "D"],
          [7002, "Цалин зардал (Бор)", "Борлуулалт, маркетингийн зардал", "", "D"],
          [7011, "НДШ зардал (Уд)", "Ерөнхий ба удирдлагын зардал", "", "D"],
          [7012, "НДШ зардал (Бор)", "Борлуулалт, маркетингийн зардал", "", "D"],
          [7031, "Ашиглалтын зардал", "Ерөнхий ба удирдлагын зардал", "", "D"],
          [7022, "түрээс", "Ерөнхий ба удирдлагын зардал", "", "D"],
          [7003, "Бичиг хэрэг, холбоо", "Ерөнхий ба удирдлагын зардал", "", "D"],
          [7004, "засвар үйлчилгээ", "Бусад зардал", "", "D"],
          [7005, "элэгдэл", "Ерөнхий ба удирдлагын зардал", "", "D"],
          [7006, "тээврийн зардал аж ахуйн", "Ерөнхий ба удирдлагын зардал", "", "D"],
          [7009, "Хүүгийн зардал", "Санхүүгийн зардал", "", "D"],
          [7007, "бусад", "Бусад зардал", "", "D"],
          [7013, "Татварын зардал", "Орлогын татварын зардал", "", "D"],
          [7008, "томилолт, тээвэр", "Борлуулалт, маркетингийн зардал", "", "D"],
          [9002, "Цалингийн тооцоо", "", "", ""],
          [9001, "OZND", "", "", "C"]
        ]
      };
    },
    components: {
      HotTable,
    },
  });
  </script>
  